<a href="https://colab.research.google.com/github/matsunori39/SQL-Cookbook-2nd-Edition/blob/main/SQL_Cookbook_2nd_Edition.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

https://oreilly-japan.github.io/sql-cookbook2-ja/

In [1]:
!pip install ipython-sql -q

In [2]:
# ipython-sqlの読み込み
%load_ext sql

# SQLiteへの接続
%sql sqlite:///tmp.sqlite3

'Connected: @tmp.sqlite3'

# はじめに

## 本書で使うテーブル

In [3]:
%%sql
CREATE TABLE dept (
  deptno INT,
  dname VARCHAR(14),
  loc VARCHAR(13));
INSERT INTO dept (deptno, dname, loc) VALUES (10, 'ACCOUNTING', 'NEW YORK');
INSERT INTO dept (deptno, dname, loc) VALUES (20, 'RESEARCH', 'DALLAS');
INSERT INTO dept (deptno, dname, loc) VALUES (30, 'SALES', 'CHICAGO');
INSERT INTO dept (deptno, dname, loc) VALUES (40, 'OPERATIONS', 'BOSTON');

 * sqlite:///tmp.sqlite3
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [4]:
%%sql
CREATE TABLE emp (
  empno INT,
  ename VARCHAR(10),
  job VARCHAR(9),
  mgr INT,
  hiredate DATE,
  sal DECIMAL(7,2),
  comm DECIMAL(7,2),
  deptno INT);
INSERT INTO emp (empno, ename, job, mgr, hiredate, sal, comm, deptno) VALUES (7369, 'SMITH' , 'CLERK'    , 7902, '17-DEC-2005', 800,  NULL, 20);
INSERT INTO emp (empno, ename, job, mgr, hiredate, sal, comm, deptno) VALUES (7499, 'ALLEN' , 'SALESMAN' , 7698, '20-FEB-2006', 1600, 300 , 30);
INSERT INTO emp (empno, ename, job, mgr, hiredate, sal, comm, deptno) VALUES (7521, 'WARD'  , 'SALESMAN' , 7698, '22-FEB-2006', 1250, 500 , 30);
INSERT INTO emp (empno, ename, job, mgr, hiredate, sal, comm, deptno) VALUES (7566, 'JONES' , 'MANAGER'  , 7839, '02-APR-2006', 2975, NULL, 20);
INSERT INTO emp (empno, ename, job, mgr, hiredate, sal, comm, deptno) VALUES (7654, 'MARTIN', 'SALESMAN' , 7698, '28-SEP-2006', 1250, 1400, 30);
INSERT INTO emp (empno, ename, job, mgr, hiredate, sal, comm, deptno) VALUES (7698, 'BLAKE' , 'MANAGER'  , 7839, '01-MAY-2006', 2850, NULL, NULL);
INSERT INTO emp (empno, ename, job, mgr, hiredate, sal, comm, deptno) VALUES (7782, 'CLARK' , 'MANAGER'  , 7839, '09-JUN-2006', 2450, NULL, 10);
INSERT INTO emp (empno, ename, job, mgr, hiredate, sal, comm, deptno) VALUES (7788, 'SCOTT' , 'ANALYST'  , 7566, '09-DEC-2007', 3000, NULL, 20);
INSERT INTO emp (empno, ename, job, mgr, hiredate, sal, comm, deptno) VALUES (7839, 'KING'  , 'PRESIDENT', NULL, '17-NOV-2006', 5000, NULL, 10);
INSERT INTO emp (empno, ename, job, mgr, hiredate, sal, comm, deptno) VALUES (7844, 'TURNER', 'SALESMAN' , 7698, '08-SEP-2006', 1500, 0   , 30);
INSERT INTO emp (empno, ename, job, mgr, hiredate, sal, comm, deptno) VALUES (7876, 'ADAMS' , 'CLERK'    , 7788, '12-JAN-2008', 1100, NULL, 20);
INSERT INTO emp (empno, ename, job, mgr, hiredate, sal, comm, deptno) VALUES (7900, 'JAMES' , 'CLERK'    , 7698, '03-DEC-2006',  950, NULL, 30);
INSERT INTO emp (empno, ename, job, mgr, hiredate, sal, comm, deptno) VALUES (7902, 'FORD'  , 'ANALYST'  , 7566, '03-DEC-2006', 3000, NULL, 20);
INSERT INTO emp (empno, ename, job, mgr, hiredate, sal, comm, deptno) VALUES (7934, 'MILLER', 'CLERK'    , 7782, '23-JAN-2007', 1300, NULL, 10);

 * sqlite:///tmp.sqlite3
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [7]:
%%sql
select * from emp;

 * sqlite:///tmp.sqlite3
Done.

[(7369, 'SMITH', 'CLERK', 7902, '17-DEC-2005', 800, None, 20),
 (7499, 'ALLEN', 'SALESMAN', 7698, '20-FEB-2006', 1600, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698, '22-FEB-2006', 1250, 500, 30),
 (7566, 'JONES', 'MANAGER', 7839, '02-APR-2006', 2975, None, 20),
 (7654, 'MARTIN', 'SALESMAN', 7698, '28-SEP-2006', 1250, 1400, 30),
 (7698, 'BLAKE', 'MANAGER', 7839, '01-MAY-2006', 2850, None, None),
 (7782, 'CLARK', 'MANAGER', 7839, '09-JUN-2006', 2450, None, 10),
 (7788, 'SCOTT', 'ANALYST', 7566, '09-DEC-2007', 3000, None, 20),
 (7839, 'KING', 'PRESIDENT', None, '17-NOV-2006', 5000, None, 10),
 (7844, 'TURNER', 'SALESMAN', 7698, '08-SEP-2006', 1500, 0, 30),
 (7876, 'ADAMS', 'CLERK', 7788, '12-JAN-2008', 1100, None, 20),
 (7900, 'JAMES', 'CLERK', 7698, '03-DEC-2006', 950, None, 30),
 (7902, 'FORD', 'ANALYST', 7566, '03-DEC-2006', 3000, None, 20),
 (7934, 'MILLER', 'CLERK', 7782, '23-JAN-2007', 1300, None, 10)]

In [8]:
%%sql
select * from dept;

 * sqlite:///tmp.sqlite3
Done.

[(10, 'ACCOUNTING', 'NEW YORK'),
 (20, 'RESEARCH', 'DALLAS'),
 (30, 'SALES', 'CHICAGO'),
 (40, 'OPERATIONS', 'BOSTON')]

# 1章 レコードの取得

## レシピ1.1 テーブルからすべての行と列を取得する

In [9]:
%%sql
select *
  from emp

 * sqlite:///tmp.sqlite3
Done.

[(7369, 'SMITH', 'CLERK', 7902, '17-DEC-2005', 800, None, 20),
 (7499, 'ALLEN', 'SALESMAN', 7698, '20-FEB-2006', 1600, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698, '22-FEB-2006', 1250, 500, 30),
 (7566, 'JONES', 'MANAGER', 7839, '02-APR-2006', 2975, None, 20),
 (7654, 'MARTIN', 'SALESMAN', 7698, '28-SEP-2006', 1250, 1400, 30),
 (7698, 'BLAKE', 'MANAGER', 7839, '01-MAY-2006', 2850, None, None),
 (7782, 'CLARK', 'MANAGER', 7839, '09-JUN-2006', 2450, None, 10),
 (7788, 'SCOTT', 'ANALYST', 7566, '09-DEC-2007', 3000, None, 20),
 (7839, 'KING', 'PRESIDENT', None, '17-NOV-2006', 5000, None, 10),
 (7844, 'TURNER', 'SALESMAN', 7698, '08-SEP-2006', 1500, 0, 30),
 (7876, 'ADAMS', 'CLERK', 7788, '12-JAN-2008', 1100, None, 20),
 (7900, 'JAMES', 'CLERK', 7698, '03-DEC-2006', 950, None, 30),
 (7902, 'FORD', 'ANALYST', 7566, '03-DEC-2006', 3000, None, 20),
 (7934, 'MILLER', 'CLERK', 7782, '23-JAN-2007', 1300, None, 10)]